# needed for some of the fonts
brew "svn"
# taps
tap "caarlos0/tap"
tap "git-chglog/git-chglog"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "kreuzwerker/taps"
tap "warrensbox/tap"
# formulas and casks
cask "alacritty"
cask "appcleaner"
brew "asciidoctor"
brew "asciinema"
brew "awscli"
brew "awsu"
brew "bat"
cask "brave-browser"
brew "cfn-lint"
brew "checkov"
cask "chromium"
#brew "colima"
brew "coreutils"
brew "dive"
cask "docker"
brew "duf"
brew "eksctl"
brew "envplate"
brew "exa"
brew "exercism"
brew "fd"
brew "fetch"
brew "ffmpeg"
cask "firefox"
brew "findutils"
brew "fish"
cask "fluor"
cask "font-inconsolata"
cask "font-open-sans"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-chglog"
brew "git-crypt"
brew "git-delta"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "gnutls"
brew "go"
brew "gofumpt"
brew "golangci-lint"
brew "goreleaser"
brew "go-task"
cask "gpg-suite"
cask "grammarly-desktop"
brew "graphviz"
brew "grc"
brew "grep"
brew "helm"
brew "helmfile"
brew "hey"
brew "hugo"
cask "istat-menus"
brew "jq"
brew "k3d"
#brew "keybase"
brew "kind"
cask "kitty"
brew "kops"
brew "kubectx"
brew "lame"
brew "m1-terraform-provider-helper"
brew "mas"
brew "maven"
cask "microsoft-office"
brew "minikube"
brew "mockery"
cask "mullvadvpn"
brew "neovim"
cask "ngrok"
brew "node@16" # NOTE: keep in sync with node/install.fish
brew "pnpm"
brew "pre-commit"
cask "rectangle"
brew "rust"
brew "shellcheck"
cask "sketch"
cask "slack"
cask "spotify"
brew "ssh-copy-id"
brew "starship"
brew "svu"
brew "terminal-notifier"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
brew "tfswitch"
# need to runs after 'tfswitch' to avoid the terraform install conflict
brew "terragrunt"
brew "timer"
brew "tmux"
brew "tree"
cask "tunnelblick"
brew "vegeta"
brew "virtualenv"
cask "visual-studio-code"
cask "vlc"
brew "watch"
brew "wget"
brew "yq"
cask "zoom"
brew "zoxide"
# app stores
mas "Theine", id: 955848755
mas "Spark", id: 1176895641
#mas "RSS Bot ", id: 605732865
#mas "Xcode", id: 497799835