tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "kreuzwerker/taps"
tap "git-chglog/git-chglog"
#
brew "awsu"
brew "coreutils"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "findutils"
brew "fish"
brew "gawk"
brew "gnupg"
brew "gnu-tar"
brew "gnu-sed"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "grep"
brew "grc"
brew "mas"
# TODO
#brew "asciidoctor"
#brew "asciinema"
#brew "awscli"
#brew "cfn-lint"
#brew "checkov"
#brew "dive"
#brew "envplate"
#brew "exa"
#brew "exercism"
#brew "ffmpeg"
brew "fzf"
brew "gh"
#brew "git-chglog"
#brew "go"
#brew "goreleaser"
#brew "graphviz"
brew "grc"
#brew "helm"
#brew "helmfile"
#brew "hugo"
#brew "jq"
#brew "k3d"
#brew "kind"
#brew "kops"
brew "kubectx"
#brew "lame"
#brew "maven"
#brew "minikube"
#brew "mockery"
#brew "neovim"
#brew "pre-commit"
brew "starship"
#brew "ssh-copy-id"
#brew "terraform-docs"
#brew "terragrunt"
#brew "tflint"
#brew "tfsec"
#brew "tfswitch"
#brew "tree"
#brew "vegeta"
#brew "vim"
#brew "watch"
#brew "wget"
#brew "yq"
brew "zoxide"
#
cask "1password"
cask "alfred"
cask "appcleaner"
cask "brave-browser"
#cask "cleanshot"
# later
#cask "docker"
cask "grammarly-desktop"
cask "istat-menus"
cask "iterm2"
#cask "kaleidoscope"
#cask "microsoft-office"
#cask "monodraw"
cask "mullvadvpn"
cask "ngrok"
#cask "postico"
cask "rectangle"
#cask "screenflow"
cask "signal"
cask "sketch"
cask "slack"
#cask "sonos"
cask "spotify"
#cask "tableplus"
#cask "typora"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
#
# not signed
#mas "Theine", id: 955848755
#mas "Spark", id: 1176895641
#mas "RSS Bot ", id: 605732865
# later
#mas "Xcode", id: 497799835