tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "kreuzwerker/taps"
#
brew "awsu"
brew "coreutils"
brew "git-crypt"
brew "findutils"
brew "gawk"
brew "gnupg"
brew "gnu-tar"
brew "gnu-sed"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "grep"
brew "mas"
#
cask "1password"
cask "alfred"
cask "brave-browser"
#cask "cleanshot"
cask "docker"
cask "istat-menus"
#cask "kaleidoscope"
#cask "microsoft-office"
#cask "monodraw"
cask "ngrok"
#cask "postico"
cask "rectangle"
#cask "screenflow"
cask "signal"
cask "sketch"
cask "slack"
#cask "sonos"
cask "spotify"
#cask "synology-drive"
#cask "tableplus"
#cask "typora"
cask "vlc"
cask "zoom"
#
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835